Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnSecurity.html[`WebAuthnSecurity`] methods do not set or read the <<configuration-reference,session cookie>>, so you will have to take care of it yourself, but it allows you to use other means of storing the user, such as JWT. You can use the link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnSecurity.html#rememberUser(java.lang.String,io.vertx.ext.web.RoutingContext)[`WebAuthnSecurity.rememberUser`] and link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnSecurity.html#logout(io.vertx.ext.web.RoutingContext)[`WebAuthnSecurity.logout`] methods on the same link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnSecurity.html[`WebAuthnSecurity`] class if you want to manually set up login cookies.
ja_jp: link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnSecurity.html[`WebAuthnSecurity`] メソッドは、 <<configuration-reference,session cookie>> の設定や読み取りを行わないため、それは自身で管理する必要がありますが、 JWT など他の方法を使用してユーザーを保存できます。ログイン Cookie を手動で設定したい場合は、 同じ link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnSecurity.html[`WebAuthnSecurity`] クラスの link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnSecurity.html#rememberUser(java.lang.String,io.vertx.ext.web.RoutingContext)[`WebAuthnSecurity.rememberUser`] および link:{webauthn-api}/io/quarkus/security/webauthn/WebAuthnSecurity.html#logout(io.vertx.ext.web.RoutingContext)[`WebAuthnSecurity.logout`] メソッドを使用できます。

source: The links to these external references are known at build time. So to get links like this on your card, you add the following Build Step in your extension:
ja_jp: 外部参照へのリンクはビルド時に判明するため、このようなリンクをカードに表示するには、エクステンションに以下のビルドステップを追加します。

source: The linux https://linux.die.net/man/1/pmap[pmap] and https://linux.die.net/man/1/ps[ps] tools provide a report on the native memory map for a process
ja_jp: Linux の link:https://linux.die.net/man/1/pmap[pmap] と link:https://linux.die.net/man/1/ps[ps] ツールは、プロセスのネイティブメモリマップのレポートを提供します

source: The list is a bit smaller than usual as 3.33 LTS only contains bugfixes on top of 3.32.
ja_jp: 3.33 LTSは3.32のバグ修正のみを含んでいるため、リストは通常より少し短くなっています。

source: The list is sorted by priority as defined by `io.quarkus.arc.InjectableBean#getPriority()`. Higher priority goes first. In general, the `@jakarta.annotation.Priority` annotation can be used to assign the priority to a class bean, producer method or producer field.
ja_jp: リストは、 `io.quarkus.arc.InjectableBean#getPriority()` で定義された優先度でソートされます。優先度の高いものが最初に来ます。一般に、 `@jakarta.annotation.Priority` アノテーションを使用して、クラス Bean、プロデューサーメソッド、またはプロデューサーフィールドに優先度を割り当てることができます。

source: The list is sorted by priority as defined by `io.quarkus.arc.InjectableBean#getPriority()`. Higher priority goes first. In general, the `@javax.annotation.Priority` and `@io.quarkus.arc.Priority` annotations can be used to assign the priority to a class bean, producer method or producer field.
ja_jp: リストは、 `io.quarkus.arc.InjectableBean#getPriority()` で定義されている優先度で並べ替えられます。優先度の高い方が優先されます。一般に、 `@javax.annotation.Priority` および `@io.quarkus.arc.Priority` アノテーションを使用して、クラス Bean、プロデューサーメソッド、またはプロデューサーフィールドに優先度を割り当てることができます。

source: The list of datasources is defined at build time, so with this approach the **list** of tenants is **fixed at build time**. If the list of tenants needs to change at runtime, you must <<programmatically-resolving-tenants-connections,resolve the tenant connections programmatically>>.
ja_jp: データソースのリストはビルド時に定義されるため、この方法ではテナントの **リスト** は **ビルド時に固定** されます。 実行時にテナントのリストを変更する必要がある場合は、 xref:programmatically-resolving-tenants-connections[プログラムでテナント接続を解決する] 必要があります。

source: The list of exemplars with tracing data for the values recorded. We only show 1 of 3 exemplars for brevity.
ja_jp: 記録された値のトレースデータを含む例のリスト。 3 つの例のうち 1 つだけを示し、簡潔にまとめています。

source: The list of extensions to add to the project (comma-separated)
ja_jp: プロジェクトに追加するエクステンションのリスト (カンマ区切り)

source: The list of the available Docker images can be found on https://quay.io/repository/quarkus/ubi-quarkus-graalvmce-builder-image?tab=tags[quay.io]. Be aware that a given Quarkus version might not be compatible with all the images available.
ja_jp: 利用可能なDockerイメージのリストは、 link:https://quay.io/repository/quarkus/ubi-quarkus-native-image?tab=tags[quay.io]にあります。特定のQuarkusのバージョンは、利用可能なすべてのイメージと互換性がない場合があることに注意してください。

source: The list of the available Docker images can be found on https://quay.io/repository/quarkus/ubi-quarkus-mandrel-builder-image?tab=tags[quay.io]. Be aware that a given Quarkus version might not be compatible with all the images available.
ja_jp: 利用可能なDockerイメージのリストは link:https://quay.io/repository/quarkus/ubi-quarkus-mandrel-builder-image?tab=tags[quay.io] にあります。Quarkusのバージョンが、利用可能な全てのイメージと互換性があるとは限りません。

source: The list of the available Docker images can be found on https://quay.io/repository/quarkus/ubi-quarkus-native-image?tab=tags[quay.io]. Be aware that a given Quarkus version might not be compatible with all the images available.
ja_jp: 利用可能なDockerイメージのリストは、 link:https://quay.io/repository/quarkus/ubi-quarkus-native-image?tab=tags[quay.io]にあります。特定のQuarkusのバージョンは、利用可能なすべてのイメージと互換性がない場合があることに注意してください。

source: The list of the available Docker images can be found on https://quay.io/repository/quarkus/ubi9-quarkus-mandrel-builder-image?tab=tags[quay.io]. Be aware that a given Quarkus version might not be compatible with all the images available.
ja_jp: 利用可能なDockerイメージのリストは、 link:https://quay.io/repository/quarkus/ubi9-quarkus-mandrel-builder-image?tab=tags[quay.io] にあります。 あるQuarkusのバージョンが、利用可能なすべてのイメージと互換性があるとは限りません。

source: The listener is invoked every time the consumer topic/partition assignment changes. For example, when the application starts, it invokes the `partitionsAssigned` callback with the initial set of topics/partitions associated with the consumer. If, later, this set changes, it calls the `partitionsRevoked` and `partitionsAssigned` callbacks again, so you can implement custom logic.
ja_jp: リスナーは、コンシューマートピック/パーティションの割り当てが変更されるたびに呼び出されます。たとえば、アプリケーションが起動すると、コンシューマーに関連付けられたトピック/パーティションの初期セットを使用して `partitionsAssigned` コールバックが呼び出されます。後でこのセットが変更された場合、 `partitionsRevoked` および `partitionsAssigned` コールバックが再度呼び出されるため、カスタムロジックを実装することができます。

source: The live coding fast feedback loop was very useful when developing with Quarkus. Although fast startup was nice, it wasn’t critical since our apps are long-running, but during development, as we tweaked our APIs, being able to immediately re-test saved us a ton of development time.
ja_jp: Quarkusでの開発では、ライブコーディングによる高速なフィードバックループが非常に役立ちました。起動が速いのはいいことですが、私たちのアプリは長時間稼働しているので、それほど重要ではありませんでした。しかし、開発中にAPIを微調整する際に、すぐに再テストができることで、開発時間を大幅に短縮することができました。

source: The load shedding algorithm
ja_jp: 負荷制限アルゴリズム

source: The load shedding algorithm has 2 parts:
ja_jp: 負荷制限アルゴリズムには 2 つの部分があります。

source: The load shedding extension currently only applies to HTTP requests, and is heavily skewed towards request/response network interactions. This means that gRPC, WebSocket and other kinds of streaming over HTTP are not supported. Other "entrypoints" to Quarkus applications, such as messaging, are not supported either.
ja_jp: 負荷制限エクステンションは現在、HTTP リクエストにのみ適用され、リクエスト/レスポンスのネットワークインタラクションに大きく偏っています。 そのため、gRPC、WebSocket、その他の HTTP 経由のストリーミングはサポートされていません。 メッセージングなどの Quarkus アプリケーションへの他の「エントリーポイント」もサポートされていません。

source: The local variable `price` is initialized with expression `item.price`.
ja_jp: ローカル変数 `price` は、式 `item.price` で初期化されます。

source: The local variable is initialized with an expression that can also represent a <<literals,literal>>, i.e. `isActive=false` and `age=10`.
ja_jp: ローカル変数は、<<literals,literal>> を表すことができる式 (つまり `isActive=false` と `age=10`) で初期化されます。

source: The local variable is initialized with an expression that can also represent a <<literals,literal>>.
ja_jp: ローカル変数は、 <<literals,リテラル>> を表すこともできる式で初期化されます。

source: The local variable is initialized with an expression that can also represent a xref:literals[literal], i.e. `isActive=false` and `age=10`.
ja_jp: ローカル変数は、 xref:literals[リテラル] を表すこともできる式、すなわち `isActive=false` と `age=10` で初期化されます。

source: The location of the getting started page.
ja_jp: はじめにのページの場所。

source: The location of the project GitHub organization.
ja_jp: プロジェクトの GitHub 組織の場所。

source: The location of the project github organization.
ja_jp: プロジェクトのgithub組織の場所です。

source: The location of the project home page.
ja_jp: プロジェクトのホームページの場所。

source: The location of the transaction logs cannot be configured in this way and must be configured via a system property (`ObjectStoreEnvironmentBean.objectStoreDir`):
ja_jp: トランザクションログの場所はこの方法では設定できないため、システムプロパティ( `ObjectStoreEnvironmentBean.objectStoreDir`)で設定する必要があります。

source: The log controller is used to add control buttons to a (footer) log. See <<Add a footer tab>>.
ja_jp: ログコントローラーは、コントロールボタンを (フッター) ログに追加するために使用します。 <<Add a footer tab>> を参照してください。

source: The log controller is used to add control buttons to a (footer) log. See <<footer>>.
ja_jp: ログコントローラーは、(フッター) ログにコントロールボタンを追加するために使用されます。 <<footer>> を参照してください。

source: The log event carries OpenTracing information as well. In order to print OpenTracing information to the console output, the console log handler with the required OpenTracing event's keys needs to be defined in the `application.properties` file.
ja_jp: ログイベントは OpenTracing の情報も含んでいます。OpenTracingの情報をコンソール出力するためには、必要なOpenTracingイベントのキーを持つコンソールログハンドラを `application.properties` ファイルで定義する必要があります。

source: The logged message is printed. When the application is stopped, the second log message is printed.
ja_jp: ログメッセージが表示されます。アプリケーションが停止すると、2つ目のログメッセージが印刷されます。

source: The logger instances are cached internally. Therefore, when a logger is injected, for example, into a `@RequestScoped` bean, it is shared for all bean instances to avoid possible performance penalties associated with logger instantiation.
ja_jp: ロガーインスタンスは、内部的にキャッシュされます。したがって、ロガーが例えば `@RequestScoped` Bean に注入されるとき、ロガーのインスタンス化に関連する可能性のあるパフォーマンスペナルティを避けるために、ロガーはすべての Bean インスタンスで共有されます。

source: The logger instances are cached internally. Therefore, a logger injected e.g. into a `@RequestScoped` bean is shared for all bean instances to avoid possible performance penalty associated with logger instantiation.
ja_jp: ロガーインスタンスは内部的にキャッシュされます。したがって、例えば `@RequestScoped` Bean に注入されたロガーは、ロガーのインスタンス化に関連する可能性のあるパフォーマンスのペナルティを回避するために、すべての Bean インスタンスで共有されます。

source: The logger is created with `org.jboss.logging.Logger.getLogger(SimpleBean.class)`.
ja_jp: ロガーは `org.jboss.logging.Logger.getLogger(SimpleBean.class)` で作成されます。

source: The logging format string supports the following symbols:
ja_jp: ログフォーマット文字列は、以下のシンボルをサポートしています:

source: The logging functionality is experimental and *off* by default. You will need to activate it by setting:
ja_jp: ロギング機能は実験的なものであり、デフォルトで *off* になっています。これは、次の設定で有効にする必要があります。

source: The logging functionality is tech preview and *off* by default. You will need to activate it by setting:
ja_jp: ロギング機能はテクニカルプレビューであり、デフォルトで *off* になっています。これを有効にするには、次の設定を行う必要があります。

source: The logging implementation is not included in the native executable, but you can resolve this issue using JBoss Logging adapters.
ja_jp: ロギングの実装はネイティブ実行可能ファイルには含まれていませんが、JBoss Logging アダプターを使用してこの問題を解決できます。

source: The logout configuration described in the <<logout-properties>> section supports standard OIDC logout mechanism, with the Quarkus endpoint coordinating the logout process with the OIDC provider. Sometimes, you may want to do the xref:security-oidc-code-flow-authentication.adoc#local-logout[local logout] only to clear the local session cookie.
ja_jp: <<logout-properties>> セクションで説明されているログアウト設定は、標準的な OIDC ログアウトメカニズムをサポートしており、Quarkus エンドポイントが OIDC プロバイダーとログアウトプロセスを調整します。ローカルセッション Cookie をクリアするためだけに xref:security-oidc-code-flow-authentication.adoc#local-logout[ローカルログアウト] を行いたい場合もあります。

source: The long story
ja_jp: 長文での説明

source: The loop section makes it possible to iterate over an instance of `Iterable`, `Iterator`, array, `Map` (element is a `Map.Entry`), `Stream`, `Integer` and `int` (primitive value). A `null` parameter value results in a no-op.
ja_jp: ループセクションでは、 `Iterable`、 `Iterator`、array、 `Map` (要素は `Map.Entry`)、 `Stream`、 `Integer`、 `int` (プリミティブ値) のインスタンスに対して反復処理することができます。パラメーター値に `null` を指定すると、no-op となります。

source: The loop section makes it possible to iterate over an instance of `Iterable`, `Iterator`, array, `Map` (element is a `Map.Entry`), `Stream`, `Integer` and `int` (primitive value). It has two flavors. The first one is using the `each` name and `it` is an implicit alias for the iteration element.
ja_jp: ループセクションでは、 `Iterable` 、 `Iterator` 、array、 `Map` （要素は `Map.Entry` ）、 `Stream` 、 `Integer` 、 `int` （プリミティブ値）のインスタンスを繰り返し処理することができます。 これには2種類あります。 1つ目は `each` の名前を使用し、 `it` は反復要素の暗黙のエイリアスです。

source: The loop section makes it possible to iterate over an instance of `Iterable`, `Iterator`, array, `Map` (element is a `Map.Entry`), `Stream`, `Integer`, `Long`, `int` and `long` (primitive value). A `null` parameter value results in a no-op.
ja_jp: ループセクションでは、`Iterable`、`Iterator`、array、`Map` (要素は `Map.Entry`)、`Stream`、`Integer`、`Long`、`int` および `long` (プリミティブ値) のインスタンスに対して反復処理できます。 パラメーター値に `null` を指定すると、no-op となります。

source: The loop section makes it possible to iterate over iterables, maps and streams.
ja_jp: ループセクションでは、イテレーション、マップ、ストリームの反復処理が可能になります。

source: The lower level REST Client
ja_jp: 低レベルRESTクライアント

source: The mailer lets you send `io.quarkus.mailer.Mail` objects. You can create new `io.quarkus.mailer.Mail` instances from the constructor or from the `Mail.withText` and `Mail.withHtml` helper methods. The `Mail` instance lets you add recipients (to, cc, or bcc), set the subject, headers, sender (from) address...
ja_jp: Mailerでは、 `io.quarkus.mailer.Mail` のオブジェクトを送信することができます。新しい `io.quarkus.mailer.Mail` インスタンスは、コンストラクタや `Mail.withText` および `Mail.withHtml` といったヘルパーメソッドから作成できます。 `Mail` インスタンスでは、受信者（to、cc、bcc）の追加、件名、ヘッダー、送信者（from）アドレスの設定などができます。

source: The mailjet integration is used on an SMTP relay. You are going to send the email using this SMTP server.
ja_jp: MailJetの統合は、SMTPリレーで使用されます。このSMTPサーバーを使ってメールを送信することになります。

source: The main Dev UI page includes an empty *OpenID Connect* card when Dev Services for Keycloak is disabled and the `quarkus.oidc.auth-server-url` property has not been initialized:
ja_jp: Dev Services for Keycloak が無効になっていて、`quarkus.oidc.auth-server-url` プロパティーが初期化されていない場合、メインの Dev UI ページに空の *OpenID Connect* カードが表示されます。

source: The main Dev UI page will include an empty `OpenID Connect Card` when `Dev Services for Keycloak` is disabled and the `quarkus.oidc.auth-server-url` property has not been initialized:
ja_jp: `Dev Services for Keycloak` が無効で `quarkus.oidc.auth-server-url` プロパティーが初期化されていない場合、メインの Dev UI ページには空の `OpenIDConnectCard` が含まれます。

source: The main advantage over `@Scheduled#delay()` is that the value is configurable. The `delay` attribute supports <<config-reference#property-expressions,Property Expressions>> including default values and nested Property Expressions. (Note that `"{property.path}"` style expressions are still supported but don't offer the full functionality of Property Expressions.)
ja_jp: `@Scheduled#delay()` と比較した場合の主な利点は、値が設定可能であることです。 `delay` 属性は、デフォルト値やネストされたプロパティ式を含む link:config-reference.html#using_property_expressions[プロパティ式]をサポートしています。(なお、 `"{property.path}"` スタイルの表現はサポートされていますが、プロパティ式の完全な機能は提供されていません)。

source: The main advantage over `@Scheduled#delay()` is that the value is configurable. The `delay` attribute supports xref:config-reference.adoc#property-expressions[Property Expressions] including default values and nested Property Expressions. (Note that `"{property.path}"` style expressions are still supported but don't offer the full functionality of Property Expressions.)
ja_jp: `@Scheduled#delay()` に対する主な利点は、値が設定可能であることです。 `delay` 属性は、デフォルト値やネストされたProperty Expressionを含む xref:config-reference.adoc#property-expressions[Property Expressions] に対応しています。(なお、 `"{property.path}"` スタイル式はまだサポートされていますが、Property Expressions の全機能を提供するものではありません。)

source: The main build step will only be executed in dev mode.
ja_jp: メインのビルドステップは、dev モードでのみ実行されます。

source: The main challenge I see going forward, similarly to app stores 10 or 15 years ago, is to make sure that the extension eco-system grows in quantity without sacrifice for quality. Or at least provide a way to rate extensions, so that people building business critical applications get assurances that their investment in the technology is sound. In other words going deep in addition to going wide. The other challenge I see is progressively filling the gaps of enterprise readiness; for instance finishing up solutions sometimes partially developed today, and making sure there is a clear and mature solution for the most common use cases.
ja_jp: 10年前、15年前のアプリストアと同じように、私が考える今後の主な課題は、エクステンションのエコシステムが、品質を犠牲にすることなく量的に成長するようにすることです。あるいは、少なくともエクステンションを評価する方法を提供して、ビジネスクリティカルなアプリケーションを構築する人々が、テクノロジーへの投資が適切であることを保証できるようにすることです。言い換えれば、"広く広く "に加えて "深く "ということです。私が考えるもう一つの課題は、企業の準備状況のギャップを徐々に埋めていくことです。例えば、今日、部分的に開発されているソリューションを完成させ、最も一般的なユースケースに対して明確で成熟したソリューションを提供できるようにすることです。

source: The main change we made is a downgrade of `slf4j-jboss-logging` motivated by a regression in `slf4j-jboss-logging`: https://github.com/quarkusio/quarkus/issues/12615 .
ja_jp: 我々が行った主な変更点は、 `slf4j-jboss-logging`:https://github.com/quarkusio/quarkus/issues/12615 のリグレッションを理由とした `slf4j-jboss-logging` のダウングレードです .

source: The main difference between OIDC and OAuth2 providers is that OIDC providers return an `ID Token` that represents a user authentication, in addition to the standard authorization code flow `access` and `refresh` tokens returned by `OAuth2` providers.
ja_jp: OIDC プロバイダと OAuth2 プロバイダの主な違いは、OIDC プロバイダは `OAuth2` プロバイダが返す標準認可コードフロー `access` および `refresh` トークンに加えて、ユーザ認証を表す `ID Token` を返すことです。

source: The main difference between OpenID Connect and OAuth2 providers is that OpenID Connect providers, by building on top of OAuth2, return an `ID Token` representing a user authentication, in addition to the standard authorization code flow `access` and `refresh` tokens returned by `OAuth2` providers.
ja_jp: OpenID Connect プロバイダーと OAuth2 プロバイダーの主な違いは、OAuth2 の上に構築された OpenID Connect プロバイダーは、 `OAuth2` プロバイダーが返す標準の認可コードフロー `access` と `refresh` トークンに加えて、ユーザー認証を表す `ID トークン` を返すという点です。

source: The main difference between `OpenID Connect` and `OAuth2` providers is that `OpenID Connect` providers, by building on top of `OAuth2`, return an `ID Token` representing a user authentication, in addition to the standard authorization code flow `access` and `refresh` tokens returned by `OAuth2` providers.
ja_jp: `OpenID Connect` と `OAuth2` プロバイダの主な違いは、 `OpenID Connect` プロバイダが `OAuth2` の上に構築することで、 `OAuth2` プロバイダが返す標準的な認可コードフロー `access` と `refresh` トークンに加えて、ユーザ認証を表す `ID Token` を返すことです。

source: The main difference in this example is that the `@RolesAllowed` annotation is used to verify that only users granted the `admin` role can access the endpoint.
ja_jp: この例の主な違いは、`admin` ロールを付与されたユーザーのみがエンドポイントにアクセスできることを確認する際に、`@RolesAllowed` アノテーションが使用される点です。

source: The main downside of creating AppCDS manually for an application is that their generation requires launching the application with special flags and obtaining the archive in a step before the application is deployed to production.
ja_jp: アプリケーション用にAppCDSを手動で作成する主な欠点は、その生成が、アプリケーションを本番にデプロイする前の段階で、特別なフラグでアプリケーションを起動し、アーカイブを取得する必要があることです。

source: The main goal of this section is to explain how Quarkus can be tuned to accept `opaque` bearer Auth0 access tokens as opposed to Auth0 JWT access tokens because Auth0 access tokens issued during the authorization code flow are opaque by default and they can only be used to request `UserInfo` in addition to the information about the current user which is already available in ID token. Learning how to verify opaque tokens can be useful because many OIDC and OAuth2 providers will issue opaque access tokens only.
ja_jp: このセクションでは主に、Auth0 JWT アクセストークンではなく、 `不透明` ベアラー Auth0 アクセストークンを受け入れるように Quarkus を調整する方法を説明します。なぜなら、認可コードフローで発行される Auth0 アクセストークンはデフォルトで不透明であり、すでに ID トークンで提供されている現行ユーザーの情報に加え、 `UserInfo` をリクエストするためにしか使用できないためです。多くの OIDC および OAuth2 プロバイダーは不透明アクセストークンしか発行しないため、不透明トークンの検証方法を理解すると役立ちます。

source: The main idea is to keep the logic to skip the execution outside the scheduled business methods so that it can be reused and refactored easily.
ja_jp: 主なアイデアは、スケジュールされたビジネスメソッドの外で実行をスキップするロジックを維持することで、再利用やリファクタリングが容易にできるようにすることです。

source: The main idea is to keep the the logic to skip the execution outside the scheduled business methods so that it can be reused and refactored easily.
ja_jp: 主なアイデアは、スケジュールされたビジネスメソッドの外で実行をスキップするロジックを維持することで、再利用やリファクタリングが容易にできるようにすることです。

source: The main method
ja_jp: メインメソッド

source: The main properties to configure are: `contact-points`, to access the Cassandra database; `local-datacenter`, which is required by the driver; and – optionally – the keyspace to bind to.
ja_jp: 構成する主なプロパティーは次のとおりです。Cassandraデータベースにアクセスするための `contact-points` 、ドライバーによって必要とされる `local-datacenter` そしてオプションでバインド先のキースペースです。

source: The main property to configure is the URL to access the MongoDB instance. Almost all configuration can be included in the connection URI, so we advise you to do so. You can find more information in the MongoDB documentation: https://docs.mongodb.com/manual/reference/connection-string/
ja_jp: 設定する主なプロパティーは、MongoDB インスタンスにアクセスするための URL です。ほぼすべての設定を接続 URI に含めることができるため、そうすることを推奨します。詳細は、MongoDB のドキュメント https://docs.mongodb.com/manual/reference/connection-string/ を参照してください。

source: The main property to configure is the URL to access to MongoDB, almost all configuration can be included in the connection URI so we advise you to do so, you can find more information in the MongoDB documentation: https://docs.mongodb.com/manual/reference/connection-string/
ja_jp: 設定する主なプロパティーは MongoDB にアクセスするための URL です。ほとんどすべての設定は接続 URI に含めることができるので、そうすることをお勧めします : https://docs.mongodb.com/manual/reference/connection-string/

source: The main property to configure is the URL to access to MongoDB. Almost all configuration can be included in the connection URI, so we advise you to do so. You can find more information in the MongoDB documentation: https://docs.mongodb.com/manual/reference/connection-string/
ja_jp: 設定する主なプロパティーはMongoDBにアクセスするためのURLです。ほとんどすべての設定は接続URIに含めることができるので、そうすることをお勧めします。 MongoDBドキュメントで、さらに情報を得ることができます: https://docs.mongodb.com/manual/reference/connection-string/

source: The main property to configure is the URL to connect to the Elasticsearch cluster.
ja_jp: 設定する主なプロパティーは、Elasticsearchクラスターに接続するためのURLです。

source: The main template also includes https://jquery.com/[jQuery 3.5.1], but here again this might change.
ja_jp: メインテンプレートには link:https://jquery.com/[jQuery 3.5.1] も含まれていますが、こちらも変わるかもしれません。

source: The main thing to understand about RESTEasy Classic is that it *always* handles requests on a worker thread as it does not use the event-loop concept at all.
ja_jp: RESTEasy Classic について最も理解しておくべきこととして、RESTEasy Classic はイベントループの概念を一切使用しないため、*常に*ワーカースレッド上でリクエストを処理することがあります。

source: The main token grants that `OidcClient` can use to acquire the tokens are the `client_credentials` (default) and `password` grants.
ja_jp: `OidcClient` がトークンを取得するために使用できる主なトークングラントは、 `client_credentials` (デフォルト) と `password` グラントです。

source: The main token grants which `OidcClient` can use to acquire the tokens are the `client_credentials` (default) and `password` grants.
ja_jp: `OidcClient` がトークンを取得するために使用できる主なトークングラントは、 `client_credentials` (デフォルト) と `password` グラントです。

source: The management interface does not use the HTTP root path from the main HTTP server.
ja_jp: マネジメントインタフェースは、メインHTTPサーバーからのHTTPルートパスを使用しません。
